Console.WriteLine("Введите число: ");
int num = Convert.ToInt32(Console.ReadLine());
double num2 = num%2;
if (num2==0) 
{
Console.WriteLine("число четное");
}
else
Console.WriteLine("Число нечетное");




/*Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

4 -> да
-3 -> нет
7 -> нет*/